#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные =  Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	ИНдекс = 0;
	Индекс = Индекс + 123;
	
	//добавление новой функциональности
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанные =  Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	//добавим новую строку
	Тест = 0;
	Тест = Тест + 12345;
	
	//Доделка задачи для таск1234
<<<<<<< Upstream, based on bugfix/Task12346
	//добавили новую ветку 123456
	//добавили предыдущую ветку 12345
=======
	//добавим новую строку
>>>>>>> 712c20c Таск 12345
	
КонецПроцедуры
#КонецОбласти
